Revit 2026 API

# RebarUpdateCurvesDataSetHookPlaneNormalForBarIdx Method

---

**Note: This API is now obsolete.**

Sets the plane's normal in which the termination at end of bar with index barPositionIndex will stay. The normal will be used for both hook and crank. This information is set to the rebar after the API execution is finished successfully.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.SetTerminationPlaneNormalForBarIdx instead.")]
public void SetHookPlaneNormalForBarIdx(
	int end,
	int barPositionIndex,
	XYZ terminationPlaneNormal
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.SetTerminationPlaneNormalForBarIdx instead.")>
Public Sub SetHookPlaneNormalForBarIdx (
	end As Integer,
	barPositionIndex As Integer,
	terminationPlaneNormal As XYZ
)
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.SetTerminationPlaneNormalForBarIdx instead.")]
void SetHookPlaneNormalForBarIdx(
	int end,
	int barPositionIndex,
	XYZ^ terminationPlaneNormal
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.SetTerminationPlaneNormalForBarIdx instead.")>]
member SetHookPlaneNormalForBarIdx :
        end : int *
        barPositionIndex : int *
        terminationPlaneNormal : XYZ -> unit
```

#### Parameters

end Int32
     The end of bar. Should be 0 for start or 1 for end.
barPositionIndex Int32
     Index of the bar for which it will set the termination's plane normal.
terminationPlaneNormal XYZ
     The plane's normal in which the termination at end of bar with index barPositionIndex will stay. The normal will be used for both hook and crank.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | Invalid end. -or- terminationPlaneNormal has zero length. |

This information is set to the rebar after the API execution is finished successfully. Before setting the value a validation will be done. We consider a termination plane normal valid if it's perpendicular with the bar direction at end.

#### Reference

RebarUpdateCurvesData Class

Autodesk.Revit.DB.Structure Namespace